#language: ru

Функционал: поиск ТВ

  Сценарий: поиск Samsung and JG

    Когда выбран пункт главного меню "Маркет"
    Когда выбран тип продукта "Электроника" для поиска
    Когда переход к категории "Телевизоры"
    Тогда нажать на кнопку Все фильтры
    Когда выбрать брэнд товара "Samsung"
    Когда выбрать брэнд товара "LG"
    Когда установить минимальную цену в "20000"
    Когда нажать на кнопку Показать результаты
    Когда выведено результатов "48"
    Когда запомнить название "0" элемента
    Когда сделать поиск "0" элемента